//Тема: довжина вектора

//Визначити довжину вектора за його координатами.

//Вхідні дані: чотири цілі числа х1, у1, х2, у2 - кордина ти початку та кінця вектора відповідно

//Вихідні дані: одне число - довжина вектора з точністю до шести знаків після коми


#include <stdio.h>
#include <math.h>

double vectorLength(int x1, int y1, int x2, int y2) {
    int dx = x2 - x1; // Різниця між координатами x2 та x1
    int dy = y2 - y1; // Різниця між координатами y2 та y1

    double length = sqrt(dx * dx + dy * dy); // Обчислення довжини вектора за формулою sqrt(dx^2 + dy^2)

    return length;
}

int main() {
    int x1, y1, x2, y2;
    printf("Введіть координати початку вектора (x1, y1): ");
    scanf("%d %d", &x1, &y1);

    printf("Введіть координати кінця вектора (x2, y2): ");
    scanf("%d %d", &x2, &y2);

    double result = vectorLength(x1, y1, x2, y2); // Обчислення довжини вектора

    printf("Довжина вектора: %.6f\n", result); // Виведення довжини вектора з точністю до шести знаків після коми

    return 0;
}
