//Тема: задача на знаходження НСК

//Знайти найменше спільне кратне р натуральних чисел

//Вхідні дані: в першому рядку задано кількість чисел р(2 ≤ р ≤ 20), а в другому рядку р натуральних чисел, розділені пробілом

//Вихідні дані: найменше спільне кратне заданих чисел

#include <stdio.h>

// Цей пункт відповідає за функцію для знаходження найбільшого спільного дільника (НСД)
int findGCD(int a, int b) {
    if (b == 0)
        return a;
    else
        return findGCD(b, a % b);
}

// Цей пункт відповідає за функцію для знаходження найменшого спільного кратного (НСК)
int findLCM(int a, int b) {
    return (a * b) / findGCD(a, b);
}

int main() {
    int n, i, numbers[20], lcm;

    // Цей пунк зчитує кількость чисел та самі числа
    scanf("%d", &n);
    for (i = 0; i < n; i++) {
        scanf("%d", &numbers[i]);
    }

    //  НСК першим числом
    lcm = numbers[0];

    // Знаходження НСК для решти чисел
    for (i = 1; i < n; i++) {
        lcm = findLCM(lcm, numbers[i]);
    }

    // Получаємо результат
    printf("%d\n", lcm);

    return 0;
}
