//Тема: задача з одиницями

//Обчислити кількість послідовностей довжиною n, що складаються лише з нулів і одиниць, де не зустрічається три одиниці підряд.

//Вхідні дані: Довжина послідовностей n (1 < n < 10000)

//Вихідні дані: Вивести кількість шуканих послідовностей за модулем 12345.


#include <stdio.h>

int countSequences(int n) {
    int a = 1; // Кількість послідовностей довжиною 1 з нулів і одиниць, де не зустрічається три одиниці підряд
    int b = 1; // Кількість послідовностей довжиною 2 з нулів і одиниць, де не зустрічається три одиниці підряд
    int c = 0; // Змінна для обчислення кількості послідовностей довжиною більше 2

    for (int i = 3; i <= n; i++) {
        c = (a + b) % 12345; // Обчислюємо кількість послідовностей довжиною i
        a = b; // Оновлюємо значення a
        b = c; // Оновлюємо значення b
    }

    return c;
}

int main() {
    int n;
    printf("Введіть довжину послідовності n: ");
    scanf("%d", &n);

    int result = countSequences(n);

    printf("Кількість шуканих послідовностей за модулем 12345: %d\n", result);

    return 0;
}
