// Перший гість може з’їсти пиріг за t1 годин, другий гість може з’їсти пиріг за t2 годин,
// третій гість може з'їсти пиріг за t3 годин. Скільки часу потрібно гостям щоб з’їсти один пиріг?
//
//Вхідні дані: один рядок який містить три натуральних числа t1, t2, t3,
//  кожне з котрих не перевищує 10000.
//
//Вихідні дані: вивести час в годинах, за який гості разом можуть з’їсти пиріг.
// Результат округлити до 2 знаків після коми
#include <stdio.h>


int main() {
    int t1, t2, t3;
    double total_time;

    // Цей пунк зчитує дані, які ми задамо
    scanf("%d %d %d", &t1, &t2, &t3);

    // Цей пунк обчислює загалний час
    total_time = 1.0 / (1.0 / t1 + 1.0 / t2 + 1.0 / t3);

    // Цей пункт відповідає за виведення результату з округленням до 2 знаків після коми
    printf("%.2f\n", total_time);

    return 0;
}

